backend/app/Controllers/Products.php

    public function index(){
        $model = new ProductModel();
        $data['products'] = $model->orderBy('id','DESC')->findAll();
        // print_r($data);

        // category
        $catmodel = new CategoryModel();
        $data['cats'] = $catmodel->orderBy('cat_name')->findAll();
---
SELECT *
FROM `products`
ORDER BY `id` DESC
SELECT *
FROM `categories`
ORDER BY `cat_name`

    public function new(){

        $catmodel = new CategoryModel();
        $data['cats'] = $catmodel->orderBy('cat_name')->findAll();
---
SELECT *
FROM `categories`
ORDER BY `cat_name`

    public function edit($id = null){

        $model = new ProductModel();
        $data['product'] = $model->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '4'