backend/app/Controllers/ProductFrontend.php

    public function index(){
        $model = new ProductModel();
        $products = $model->orderBy('id','DESC')->findAll();
---
SELECT *
FROM `products`
ORDER BY `id` DESC