backend/app/Controllers/SigninController.php

    public function loginAuth(){

        $session = session();
        $userModel = new UsersModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'sajedul@gmail.com'
 LIMIT 1